/*************************************************************/
/*  ECU検査テストの定義                                      */
/*************************************************************/
#ifndef	__ECU_TEST_H__
#define	__ECU_TEST_H__

/*--------------------------------------------------------------------------*/
/*		ローカル型定義														*/
/*--------------------------------------------------------------------------*/
typedef enum {
	ECU_NO_TEST,			/* 出力無し */
	ECU_TEST_IDLE,			/* ECU検査テスト実行待ち状態 */
	ECU_TST_BREAK_TEST,		/* 動作中ブレーキ出力 */
	ECU_TST_BREAK_STOP,		/* 動作中ブレーキ出力停止 */
	ECU_SOLENOID_TEST,		/* ソレノイド出力 */
	ECU_SOLENOID_STOP		/* ソレノイド出力停止 */
} ecu_test_id;	/* ECUテスト実施番号 */

/*--------------------------------------------------------------------------*/
/*		関数宣言										   				    */
/*--------------------------------------------------------------------------*/
extern void ecu_test_main(void);
extern ecu_test_id get_ecu_test_state(void);

#endif	/* __ECU_TEST_H__ */

